{"data":{"site":{"siteMetadata":{"title":"Almanac","author":"Maria Kravtsova"}},"mdx":{"id":"15e2c758-4d8a-539c-a3ed-66b08b04b5e7","excerpt":"I cannot believe it myself, but I just completed my second month at my software engineering internship. It has been hard, and I have one more month to go. Sadly…","frontmatter":{"title":"Job Search","date":"July 09, 2017"},"code":{"body":"function _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\n\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n\nreturn class MDXContent extends React.Component {\n  constructor(props) {\n    super(props);\n    this.layout = null;\n  }\n\n  render() {\n    const _this$props = this.props,\n          {\n      components\n    } = _this$props,\n          props = _objectWithoutProperties(_this$props, [\"components\"]);\n\n    return React.createElement(MDXTag, {\n      name: \"wrapper\",\n      components: components\n    }, React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `I cannot believe it myself, but I just completed my second month at my software engineering internship. It has been hard, and I have one more month to go. Sadly, I cannot share details about it, but I think the hard part really came from taking a class in Android Development and having the pressure of getting a job to start at the end of the internship. That’s another blog post… in this one I want to share some of the things I learned about job search.`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `There are two fields of CS that I really enjoy - Web Development and Machine Learning. ML is a bit harder to get to, and I knew I needed more experience than just Udacity courses and a university class. Still I made two resumes, one for each field. I sent it to every single person I could think of for proof reading. Now, when opinions are coming in - be nice, these people are spending their time to help you, appreciate it and think about what they said. It’s not personal.`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Note: The application numbers below are total I have applied, starting of January and ending in May of 2017.`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Front end development is where people start at, so I made a pretty website, very inspired by others, and I sent 89 applications. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Since I know other things as well I sent 103 applications for backend, desktop, even Android development jobs.`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Machine Learning field is a bit more selective so I sent 37 applications.`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `By sent I mean one of the below:`), React.createElement(MDXTag, {\n      name: \"ul\",\n      components: components\n    }, React.createElement(MDXTag, {\n      name: \"li\",\n      components: components,\n      parentName: \"ul\"\n    }, `Submitted an application template on their website with or without cover letter`), React.createElement(MDXTag, {\n      name: \"li\",\n      components: components,\n      parentName: \"ul\"\n    }, `Sent my resume directly to a manager (hiring or engineer)`), React.createElement(MDXTag, {\n      name: \"li\",\n      components: components,\n      parentName: \"ul\"\n    }, `Sent my resume to some contact provided on their website, hoping that one day someone will uncover my polished resume like in the Indiana Jones movies`)), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `I registered to every website that Google could point me to and make profiles on … Indeed, LinkedIn, Dice, Discord channels with interests… `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `The preparation phase started in February and I got a few interviews from just a handful of applications - I didn’t do very hot on the technical ones. I stopped applying and hit the leetcode and hackerrank. I bought a white board (not big enough), and started practicing. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Two weeks in I got an interview from the place I applied a while back, and after an hour of the interview they hang up. I was certain that I ruined my chances and needed a distraction, but after an hour or so I got a call that I am accepted into the internship program and here is their offer. Of course I took it, and made a celebratory dance.`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `My training for the technical interviews got set back, since both my friend and I got a job. I focused more on school, and by working hard and receiving help from others - I finished my Spring semester on the Dean’s List (a first one for me). After semester was over I started applying again, because I was about to spend the summer with no insurance, and my apartment lease was expiring in August - I needed answers. Well, my anxiety needed answers.`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Spoiler: I ended up with a few offers, and I chose one. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Before you get an offer there are usually between 3 or 5 rounds of interviews you have to go through. Each you collect experience, you have to really pay attention to company values, to what kind of employees they already have and if you match some of those qualities. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Technical round advice: you will fail your first ones, learn from it, over analyze them, but relax on your next one, take beta blockers if you must. Seriously - relax. During practice I learned that the best way for me to relax is for me to make jokes, it doesn’t matter that they are dumb and uncomfortable, but they break off the tension between me and the interviewer. You might have something else that helps, but find it during your practice and use it.`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Project round: Just do your best. I didn’t finish one of them (the place where I got my next job from), but I did write ideas about how I would finish it. To me this is the part that made me test if I would like this job or not. For example - if they send a boring challenge that doesn’t relate to the job - do I want to work for them? `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `People round(s): You might have a few of these depending on the company. Going to the office and meeting everyone is strange, it’s uncomfortable, but ask them questions. This is your time to interview them as well. If this is the first phone screening - ask a lot of questions, you need to get something from them that will make you motivated to go through all the rounds. This is important for you and them.`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Offer time: Part of it was my fault, who crams so many interviews in one week, was it 20 or 30, yeah, I am a little ashamed to admit. However, after all the hard work I had a handful of offers. I never thought I would have the power of making the decision. I thought things would be just like my internship - just take the first and only you have. Questions that I asked myself during the decision making:`), React.createElement(MDXTag, {\n      name: \"ul\",\n      components: components\n    }, React.createElement(MDXTag, {\n      name: \"li\",\n      components: components,\n      parentName: \"ul\"\n    }, `Are the technologies that I will be working on new enough that I will be relevant in the field? `), React.createElement(MDXTag, {\n      name: \"li\",\n      components: components,\n      parentName: \"ul\"\n    }, `Do I like the manager that I will be working for? If I get stuck on an island with the dev team, will we be ok? `), React.createElement(MDXTag, {\n      name: \"li\",\n      components: components,\n      parentName: \"ul\"\n    }, `Do I have room to be creative?`), React.createElement(MDXTag, {\n      name: \"li\",\n      components: components,\n      parentName: \"ul\"\n    }, `Will I have autonomy? `), React.createElement(MDXTag, {\n      name: \"li\",\n      components: components,\n      parentName: \"ul\"\n    }, `Will I be paid enough to relocate or to make the commute?`)), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `I have never been in a position to negotiate, and here I was - doing it terribly… thankfully I only negotiated once and they made it easy on their part as well. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Best advice - just be yourself and be honest through this entire thing. Make it sort of a game so you stay motivated, but make it an honest game. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `From my internship I learned a lot, but the most valuable information was that I am young and I would like to try to work at a small companies/startups while I can. Liking the job means more than the money they offer to me at the moment.`), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Optional lesson: Stick to your commitments. I am going to finish my internship before I start the new gig, sure I could start being salary and have insurance and all those cool perks, but I must finish what I started especially because it has an end date. `), React.createElement(MDXTag, {\n      name: \"p\",\n      components: components\n    }, `Hopefully you got something useful from this, if you have questions let me know.`));\n  }\n\n}"}}},"pageContext":{"slug":"/2017-07-09-Job-Search/","previous":{"id":"3b71fa7a-735a-5c11-af6d-17650a44efe6","fields":{"slug":"/2016-3-19-New-Theme/"},"frontmatter":{"title":"New Theme"},"code":{"scope":""}},"next":{"id":"36a2744a-1b38-577c-b1b6-1d3890fd4086","fields":{"slug":"/2017-09-07-First-Month/"},"frontmatter":{"title":"First month"},"code":{"scope":""}}}}